<?php

return [
    /*
    |--------------------------------------------------------------------------
    | Modal delete confirm
    |--------------------------------------------------------------------------
    */
    'modal_header_delete'				=> '削除の確認',
    'modal_content_delete'				=> '削除してよろしいですか？',
    'modal_btn_delete'					=> '削除する(確認済)',
    'modal_btn_cancel'					=> '削除しない',

    /*
    |--------------------------------------------------------------------------
    | Message notice success or danger: common
    |--------------------------------------------------------------------------
    */
    'message_regist_success'                => '登録が完了しました。',
    'message_regist_danger'                 => '登録できませんでした。',
    'message_edit_success'                  => '編集箇所を保存しました。',
    'message_edit_danger'                   => '編集箇所を保存できませんでした。',
    'message_delete_success'                => '削除しました。',
    'message_delete_danger'                 => '削除できませんでした。',

    /*
    |--------------------------------------------------------------------------
    | Permission: access to function, controller
    / if don't have permisstion, return to menu page
    |--------------------------------------------------------------------------
    */
    'message_permission_no_access'          => 'You do not have access!',

    /*
    |--------------------------------------------------------------------------
    | Message No Data Correspond
    |--------------------------------------------------------------------------
    */
    'no_data_correspond'                => '該当するデータがありません。',

   /*
    |--------------------------------------------------------------------------
    | Customer
    |--------------------------------------------------------------------------
    */
    'cust_title_index'					=> '顧客情報の検索結果一覧',
    'cust_title_search'					=> '顧客の検索',
    'cust_title_regist'					=> '顧客情報の新規登録',
    'cust_msg_regist_succ'				=> '登録が完了しました。',				/*	common	*/
    'cust_msg_regist_faild'				=> '登録できませんでした。',			/*	common	*/
    'cust_title_edit'					=> '顧客情報の新規登録',
    'cust_msg_edit_succ'				=> '編集箇所を保存しました。',			/*	common	*/
    'cust_msg_edit_faild'				=> '編集箇所を保存できませんでした。',	/*	common	*/
    'cust_msg_del_succ'					=> '削除しました。',					/*	common	*/
    'cust_msg_del_faild'				=> '削除できませんでした。',			/*	common	*/
    'cust_title_detail'					=> '登録済み顧客情報の参照',

    
    /*
    |--------------------------------------------------------------------------
    | Enterprise
    |--------------------------------------------------------------------------
    */
    'ent_title_list'                    => '法人情報の検索結果一覧',
    'ent_title_regist'                  => '媒体情報の新規登録',
    'ent_title_edit'                    => 'メディア情報のエディション',
    'ent_title_search'                  => '媒体の検索',
    'ent_title_detail'                  => '登録済み法人情報の詳細',

    
    /*
    |--------------------------------------------------------------------------
    | Baitai
    |--------------------------------------------------------------------------
    */
    'baitai_title_index'			=> '媒体情報の検索結果一覧',
    'baitai_title_regist'			=> '媒体情報の新規登録',
    'baitai_title_edit'				=> '媒体情報の編集',
    'baitai_title_search'			=> '媒体の検索',

    /*
    |--------------------------------------------------------------------------
    | Bunya
    |--------------------------------------------------------------------------
    */
    'bunya_title_index'				=> '分野情報の検索結果一覧',
    'bunya_title_regist'			=> '分野情報の新規登録',
    'bunya_title_edit'				=> '分野情報の編集',
    'bunya_title_search'			=> '分野の検索',

    /*
    |--------------------------------------------------------------------------
    | Campaign
    |--------------------------------------------------------------------------
    */
    'campaign_title_index'			=> 'キャンペーン情報の一覧',
    'campaign_title_regist'			=> 'キャンペーン情報の新規登録',
    'campaign_title_edit'			=> 'キャンペーン情報の編集',

    /*
    |--------------------------------------------------------------------------
    | Group Pamphlet
    |--------------------------------------------------------------------------
    */
    'gpamphlet_title_index'			=> '一括資料請求番号情報の検索結果一覧',
    'gpamphlet_title_regist'		=> '一括資料請求番号情報の新規登録',
    'gpamphlet_title_edit'			=> '一括資料請求番号情報の編集',
    'gpamphlet_title_search'		=> '一括資料請求番号の検索',

    /*
    |--------------------------------------------------------------------------
    | Menu
    |--------------------------------------------------------------------------
    */
    'menu_title_index'				=> 'メニュー',

    /*
    |--------------------------------------------------------------------------
    | Pamphlet
    |--------------------------------------------------------------------------
    */
    'pamphlet_title_index'			=> '資料請求番号情報の検索結果一覧',
    'pamphlet_title_regist'			=> '資料請求番号情報の新規登録',
    'pamphlet_title_edit'			=> '資料請求番号情報の編集',
    'pamphlet_title_search'			=> '資料請求番号の検索',
    'pamphlet_message_select_only'	=> '都道府県 または エリア のいずれかを選択してください',

    /*
    |--------------------------------------------------------------------------
    | Present
    |--------------------------------------------------------------------------
    */
    'present_title_index'			=> 'プレゼント情報の一覧',
    'present_title_regist'			=> 'プレゼント情報の新規登録',
    'present_title_edit'			=> 'プレゼント情報の編集',

    /*
    |--------------------------------------------------------------------------
    | User
    |--------------------------------------------------------------------------
    */
    'user_title_index'						=> 'ユーザー情報の一覧',
    'user_title_change_password'			=> 'パスワードの変更',
    'user_title_regist'						=> 'ユーザーの新規登録',
    'user_title_edit'						=> 'ユーザー情報の編集',
    'user_message_danger_login'				=> 'パスワードが変更できませんでした。',
    'user_message_danger_change_password'	=> '現在のパスワードが違います。',
    'user_message_success_login'			=> 'パスワードを変更しました。',

    /*
    |--------------------------------------------------------------------------
    | University
    |--------------------------------------------------------------------------
    */
    'university_title_index'         => '大学情報の検索結果一覧',
    'university_title_regist'        => '大学情報の新規登録',
    'university_title_edit'          => '大学情報の編集',
    'university_title_search'        => '大学の検索',

    /*
    |--------------------------------------------------------------------------
    | Student Contact
    |--------------------------------------------------------------------------
    */
    'stu_contact_title_index'               => 'お問い合わせ管理',
    'stu_contact_title_regist'              => 'お問い合わせ情報の新規登録',
    'stu_contact_title_edit'                => '登録済みお問い合わせ情報の編集',
    'stu_contact_title_detail'              => '登録済みお問い合わせ情報の詳細',
    'stu_contact_title_del_cnf'             => '登録済みお問い合わせ情報の削除',
];