<?php

return [

    /*
    |--------------------------------------------------------------------------
    | login
    |--------------------------------------------------------------------------
    */
    'error_u_login_required'                            => '※ログインIDを入力してください。',
    'error_password_required'                           => '※パスワードを入力してください。',

    /*
    |--------------------------------------------------------------------------
    | change password
    |--------------------------------------------------------------------------
    */
    // 'error_password_required'                               => '※パスワードを入力してください。',
    'error_new_password_required'                           => 'パスワードを入力してください。',//※パスワードを入力してください。
    'error_confim_new_password_required'                    => '新しいパスワードを入力してください。',
    'error_confim_new_password_same'                        => '新しいパスワードが一致しません。',

    /*
    |--------------------------------------------------------------------------
    | Model Area
    |--------------------------------------------------------------------------
    */
    'error_area_name_required'                           => '地域名を入力してください。',

    /*
    |--------------------------------------------------------------------------
    | Model Belong
    |--------------------------------------------------------------------------
    */
    'error_belong_name_required'                           => '所属名を入力してください。',

    /*
    |--------------------------------------------------------------------------
    | Model Clinic
    |--------------------------------------------------------------------------
    */
    'error_area_name_required'                              => '医院名を入力してください。',
    'error_clinic_name_yomi_required'                       => '医院名よみを入力してください。',
    'error_clinic_name_yomi_regex'                          => 'ひらがなで入力してください。',
    'error_clinic_display_name_required'                    => '（表示用）医院名を入力してください。',
    'error_clinic_zip3_required'                            => '郵便番号を入力してください。',
    'error_clinic_zip4_required'                            => '郵便番号を入力してください。',
    'error_clinic_address1_required'                        => '住所を入力してください。',
    'error_clinic_address2_required'                        => '住所（ビル名等）を入力してください。',
    'error_clinic_ownername_required'                       => '院長名を入力してください。',
    'error_clinic_tel_required'                             => 'TELを入力してください。',
    'error_clinic_email_required'                           => 'E-mailを入力してください。',

    /*
    |--------------------------------------------------------------------------
    | Model Inspection
    |--------------------------------------------------------------------------
    */
    'error_inspection_name_required'                           => '検査名を入力してください。',

    /*
    |--------------------------------------------------------------------------
    | Model Insurance
    |--------------------------------------------------------------------------
    */
    'error_insurance_name_required'                           => '保険診療名を入力してください。',

    /*
    |--------------------------------------------------------------------------
    | Model User
    |--------------------------------------------------------------------------
    */
    'error_u_name_required'                             => '氏名を入力してください。',
    'error_u_name_yomi_required'                        => '氏名よみを入力してください。',
    'error_u_name_yomi_regex'                           => 'ひらがなで入力してください。',
    'error_u_name_display_required'                     => '（表示用）氏名を入力してください。',
    'error_u_login_required'                            => 'ログインIDを入力してください。',
    'error_u_login_unique'                              => 'そのログインIDは既に使用されています。',
    'error_password_required'                           => 'パスワードを入力してください。',
    
        /*
    |--------------------------------------------------------------------------
    | Validation Services
    |--------------------------------------------------------------------------
    */
    'error_service_name_required'                          => 'サービス名を入力してください。',

    /*
    |--------------------------------------------------------------------------
    | Validation Equipment
    |--------------------------------------------------------------------------
    */
    'error_equipment_name_required'                       => '機器を入力してください。',

    /*
    |--------------------------------------------------------------------------
    | Model Xray
    |--------------------------------------------------------------------------
    */
    'error_p_id_required'                                   => '撮影日を選択してください。',
    'error_xray_date_required'                              => '撮影場所を選択してください。',
    'error_xray_place_required'                             => '撮影者を選択してください。',
];