<?php

return [

    /*
    |--------------------------------------------------------------------------
    | login
    |--------------------------------------------------------------------------
    */
    'error_u_login_required'                            => '※ログインIDを入力してください。',
    'error_password_required'                           => '※パスワードを入力してください。',

    /*
    |--------------------------------------------------------------------------
    | Model Area
    |--------------------------------------------------------------------------
    */
    'error_area_name_required'                           => '地域名を入力してください。',

    /*
    |--------------------------------------------------------------------------
    | Model Belong
    |--------------------------------------------------------------------------
    */
    'error_belong_name_required'                           => '所属名を入力してください。',

    /*
    |--------------------------------------------------------------------------
    | Model Clinic
    |--------------------------------------------------------------------------
    */
    'error_area_name_required'                              => '医院名を入力してください。',
    'error_clinic_name_yomi_required'                       => '医院名よみを入力してください。',
    'error_clinic_name_yomi_regex'                          => 'ひらがなで入力してください。',
    'error_clinic_display_name_required'                    => '（表示用）医院名を入力してください。',
    'error_clinic_zip3_required'                            => '郵便番号を入力してください。',
    'error_clinic_zip4_required'                            => '郵便番号を入力してください。',
    'error_clinic_address1_required'                        => '住所を入力してください。',
    'error_clinic_address2_required'                        => '住所（ビル名等）を入力してください。',
    'error_clinic_ownername_required'                       => '院長名を入力してください。',
    'error_clinic_tel_required'                             => 'TELを入力してください。',
    'error_clinic_email_required'                           => 'E-mailを入力してください。',

    /*
    |--------------------------------------------------------------------------
    | Model Inspection
    |--------------------------------------------------------------------------
    */
    'error_inspection_name_required'                           => '検査名を入力してください。',

    /*
    |--------------------------------------------------------------------------
    | Model Insurance
    |--------------------------------------------------------------------------
    */
    'error_insurance_name_required'                           => '保険診療名を入力してください。',

    /*
    |--------------------------------------------------------------------------
    | Model User
    |--------------------------------------------------------------------------
    */
    'error_u_name_required'                             => '氏名を入力してください。',
    'error_u_name_yomi_required'                        => '氏名よみを入力してください。',
    'error_u_name_yomi_regex'                           => 'ひらがなで入力してください。',
    'error_u_name_display_required'                     => '（表示用）氏名を入力してください。',
    'error_u_login_required'                            => 'ログインIDを入力してください。',
    'error_u_login_unique'                              => 'そのログインIDは既に使用されています。',
    'error_password_required'                           => 'パスワードを入力してください。',
];