<?php
//file : app/config/constants.php

return [
	'DEFINE' => array(
		'INSERT' 				=> 0,
		'UPDATE' 				=> 1,
		'DELETE' 				=> 9,

		'PAGINATION' 			=> 3, // number item in per page backend
	),

	'CLINIC_AM_START' => array(
		'0時' => '0時',
		'1時' => '1時',
		'2時' => '2時',
		'3時' => '3時',
		'4時' => '4時',
		'5時' => '5時',
		'6時' => '6時',
		'7時' => '7時',
		'8時' => '8時',
		'9時' => '9時',
		'10時' => '10時',
		'11時' => '11時',
		'12時' => '12時',
	),

	'CLINIC_AM_END' => array(
		'0時' => '0時',
		'1時' => '1時',
		'2時' => '2時',
		'3時' => '3時',
		'4時' => '4時',
		'5時' => '5時',
		'6時' => '6時',
		'7時' => '7時',
		'8時' => '8時',
		'9時' => '9時',
		'10時' => '10時',
		'11時' => '11時',
		'12時' => '12時',
		'13時' => '13時',
	),

	'CLINIC_PM' => array(
		'12時' => '12時',
		'13時' => '13時',
		'14時' => '14時',
		'15時' => '15時',
		'16時' => '16時',
		'17時' => '17時',
		'18時' => '18時',
		'19時' => '19時',
		'20時' => '20時',
		'21時' => '21時',
		'22時' => '22時',
		'23時' => '23時',
		'24時' => '24時',
	),

	'CLINIC_M' => array(
		'00分' => '00分',
		'15分' => '15分',
		'30分' => '30分',
		'45分' => '45分',
	),
];

include('function.php');